zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_ramcfg.c
/**
  ******************************************************************************
  * @file    stm32mp2xx_hal_ramcfg.c
  * @author  MCD Application Team
  * @brief   RAMCFG HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the RAMs configuration controller peripheral:
  *           + RAMCFG Initialization and De-initialization Functions.
  *           + RAMCFG ECC Operation Functions.
  *           + RAMCFG CRC Operation Functions.
  *           + RAMCFG Configure Wait State Functions.
  *           + RAMCFG Write Protection Functions.
  *           + RAMCFG Erase Operation Functions.
  *           + RAMCFG Handle Interrupt and Callbacks Functions.
  *           + RAMCFG State and Error Functions.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                    ##### RAMCFG Peripheral features #####
  ==============================================================================
  [..]
    (+) Each SRAM is managed by a RAMCFG instance.
        (++) SYSRAM placed in D2 Domain.
             (+++) Size         = 256 kB.
             (+++) Base Address = 0x20000000.

        (++) SRAM1 placed in D2 Domain.
             (+++) Size         = 128 kB.
             (+++) Base Address = 0x20040000.

        (++) SRAM2 placed in D2 Domain.
             (+++) Size         = 128 kB.
             (+++) Base Address = 0x20060000.

        (++) RETRAM placed in Backup Domain.
             (+++) Size         = 128 kB.
             (+++) Base Address = 0x20080000.

        (++) LPSRAM1 placed in Backup Domain.
             (+++) Size         = 8 kB.
             (+++) Base Address = 0x200C0000.

        (++) LPSRAM2 placed in D3 Domain.
             (+++) Size         = 8 kB.
             (+++) Base Address = 0x200C2000.

        (++) LPSRAM3 placed in D3 Domain.
             (+++) Size         = 16 kB.
             (+++) Base Address = 0x200C4000.

        (++) BKPSRAM placed in Backup Domain.
             (+++) Size         = 8 kB.
             (+++) Base Address = 0x42000000.

        (++) VDERAM placed in Video Domain.
             (+++) Size         = 128 kB.
             (+++) Base Address = 0x200A0000.

    (+) Each SRAM could be erased independently through its RAMCFG instance.

    (+) RETRAM and BKPRAM support ECC correction feature. This mechanism
        adopts the Single Error Correction Double Error Detection (SECDED)
        algorithm. This feature provides the following information:
             (++) Single error address.
             (++) Double error address.

    (+) RETRAM and LPSRAM1 support CRC (Cyclic Redundancy Check) feature.
  ==============================================================================
                        ##### How to use this driver #####
  ==============================================================================
  [..]
   (#) Call HAL_RAMCFG_Init() to initialize the RAMCFG peripheral before using
       any feature. Call HAL_RAMCFG_DeInit() to de-initialize the RAMCFG when
       using this peripheral is no more needed or a hardware issue is occurred.

     *** ECC feature ***
     ===================
    [..]
          (+) Call HAL_RAMCFG_StartECC() and HAL_RAMCFG_StopECC() to enable and
              disable ECC hardware process.

          (+) Call HAL_RAMCFG_EnableNotification() and HAL_RAMCFG_DisableNotification()
              to enable and disable ECC interrupts. Interrupts could be :
                    (++) Single error interrupt.
                    (++) Double error interrupt.
                    (++) Double error interrupt redirected to Non masKable
                          interrupt (NMI).

          (+) Call HAL_RAMCFG_GetSingleErrorAddress() to get the address of the
              last fail RAM word detected (only for single error)  and
              Call HAL_RAMCFG_GetDoubleErrorAddress() to get the address of the
              last fail RAM word detected (only for double error).

          (+) Call HAL_RAMCFG_IsECCErrorDetected() to check if an ECC single/double
              error was detected. This API is used in silent mode (No ECC interrupt
              is enabled).

     *** HW erase feature ***
     ==========================
    [..]
          (+) Call HAL_RAMCFG_HWEraseEnable() to Enable erase operation done after
              a system reset.

          (+) Call HAL_RAMCFG_HWEraseDisable() to Disable erase operation done after
              a system reset.

     *** CRC feature ***
     ================================
    [..]
          (+) Call HAL_RAMCFG_ConfigCRC() to Configure CRC mode and CRC Buffer Size.

          (+) Call HAL_RAMCFG_ComputeCRC() to compute reference CRC or compute and
              check CRC.

     *** Erase feature ***
     =====================
    [..]
          (+) Call HAL_RAMCFG_Erase() to launch a hardware erase for the given
              SRAM.

          (+) The erase value is equal to 0 when launching erase hardware through
              RAMCFG.

          (+) SRAM2 write protected pages are erased when performing an erase
              through RAMCFG.

     *** RAMCFG HAL driver macros list ***
     =====================================
     [..]
       Below the list of used macros in RAMCFG HAL driver.

      (+) __HAL_RAMCFG_ENABLE_IT     : Enable the specified RAMCFG interrupts.
      (+) __HAL_RAMCFG_DISABLE_IT    : Disable the specified RAMCFG interrupts.
      (+) __HAL_RAMCFG_GET_FLAG      : Get the RAMCFG pending flags.
      (+) __HAL_RAMCFG_CLEAR_FLAG    : Clear the RAMCFG pending flags.
      (+) __HAL_RAMCFG_GET_IT_SOURCE : Check whether the specified RAMCFG
                                       interrupt source is enabled or not.
      (+) __HAL_RAMCFG_CRC_GET_FLAG  : Get the RAMCFG CRC pending flags.
      (+) __HAL_RAMCFG_CRC_CLEAR_FLAG: Clear the RAMCFG CRC pending flags.
  @endverbatim
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx_hal.h"

/** @addtogroup STM32MP2xx_HAL_Driver
  * @{
  */

