zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_ramcfg.c
    /* Read CRC mode */
    mode = READ_BIT(hramcfg->Instance->CCR1, RAMCFG_CCR1_CRCC);

    switch (mode)
    {
      case 0: /* CRC disable so do nothing */
        break;

      case 1: /* CRC computation */

        /* Start CRC computation */
        hramcfg->Instance->CCR2 |= RAMCFG_CCR2_CRCCS;

        /* Wait computation ending */
        while (READ_BIT(hramcfg->Instance->CSR, RAMCFG_CSR_CRCEOC) != RAMCFG_CSR_CRCEOC)
        {
          if (((HAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U))
          {
            /* Update the RAMCFG error code */
            hramcfg->ErrorCode = HAL_RAMCFG_ERROR_TIMEOUT;

            /* Update the RAMCFG state */
            hramcfg->State = HAL_RAMCFG_STATE_ERROR;

            /* Return error status */
            return HAL_ERROR;
          }
        }

        /* Save calculated signature in reference signature */
        hramcfg->Instance->CRSR = hramcfg->Instance->CCSR;
        break;

      case 2: /* CRC computation and signature check */

        /* Clear registers */
        hramcfg->Instance->CCR2 |= RAMCFG_CCR2_CRCFC;

        /* Start CRC computation */
        hramcfg->Instance->CCR2 |= RAMCFG_CCR2_CRCCS;

        /* Wait computation ending */
        while (READ_BIT(hramcfg->Instance->CSR, RAMCFG_CSR_CRCEOC) != RAMCFG_CSR_CRCEOC)
        {
          if (((HAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U))
          {
            /* Update the RAMCFG error code */
            hramcfg->ErrorCode = HAL_RAMCFG_ERROR_TIMEOUT;

            /* Update the RAMCFG state */
            hramcfg->State = HAL_RAMCFG_STATE_ERROR;

            /* Return error status */
            return HAL_ERROR;
          }
        }

        /* Check CRC signature validity */
        if (READ_BIT(hramcfg->Instance->CSR, RAMCFG_CSR_CRCSCS) != RAMCFG_CSR_CRCSCS)
        {
          /* Fault detected in SRAM data */
          hramcfg->ErrorCode = HAL_RAMCFG_ERROR_CRC;

          /* Update the RAMCFG state */
          hramcfg->State = HAL_RAMCFG_STATE_READY;

          /* Return error status */
          return HAL_ERROR;
        }
        break;

      default:
        /* Update the RAMCFG state */
        hramcfg->State = HAL_RAMCFG_STATE_READY;

        /* Return error status */
        return HAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    hramcfg->ErrorCode = HAL_RAMCFG_ERROR_BUSY;

    /* Return error status */
    return HAL_ERROR;
  }

  /* Update the RAMCFG state */
  hramcfg->State = HAL_RAMCFG_STATE_READY;

  return HAL_OK;
}

/**
  * @brief  Enable erase operation done after a system reset
  * @param  hramcfg       : Pointer to a RAMCFG_HandleTypeDef structure that
  *                         contains the configuration information for the
  *                         specified RAMCFG instance.
  * @retval RAMCFG error code
  */
HAL_StatusTypeDef HAL_RAMCFG_HWEraseEnable(RAMCFG_HandleTypeDef *hramcfg)
{
  /* Check the parameters */
  assert_param(IS_RAMCFG_CRC_INSTANCE(hramcfg->Instance));

  /* Check RAMCFG state */
  if (hramcfg->State == HAL_RAMCFG_STATE_READY)
  {
    /* Update RAMCFG peripheral state */
    hramcfg->State = HAL_RAMCFG_STATE_BUSY;

    MODIFY_REG(hramcfg->Instance->CR, RAMCFG_CR_SRAMHWERDIS, 0U);
  }
  else
  {
    /* Update the error code */
    hramcfg->ErrorCode = HAL_RAMCFG_ERROR_BUSY;

    /* Return error status */
    return HAL_ERROR;
  }

  /* Update the RAMCFG state */
  hramcfg->State = HAL_RAMCFG_STATE_READY;

  return HAL_OK;
}

/**
  * @brief  Disable erase operation done after a system reset
  * @param  hramcfg       : Pointer to a RAMCFG_HandleTypeDef structure that
  *                         contains the configuration information for the
  *                         specified RAMCFG instance.
  * @retval RAMCFG error code
  */
HAL_StatusTypeDef HAL_RAMCFG_HWEraseDisable(RAMCFG_HandleTypeDef *hramcfg)
{
  /* Check the parameters */
  assert_param(IS_RAMCFG_CRC_INSTANCE(hramcfg->Instance));

  /* Check RAMCFG state */
  if (hramcfg->State == HAL_RAMCFG_STATE_READY)
  {
    /* Update RAMCFG peripheral state */
    hramcfg->State = HAL_RAMCFG_STATE_BUSY;

    MODIFY_REG(hramcfg->Instance->CR, 0U, RAMCFG_CR_SRAMHWERDIS);
  }
  else
  {
    /* Update the error code */
    hramcfg->ErrorCode = HAL_RAMCFG_ERROR_BUSY;

    /* Return error status */
    return HAL_ERROR;
  }

  /* Update the RAMCFG state */
  hramcfg->State = HAL_RAMCFG_STATE_READY;

  return HAL_OK;
}
/**
  * @}
  */


#endif /* HAL_RAMCFG_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */
